In [1]:
import pandas as pd
df = pd.read_csv(r"C:\Users\lapto\OneDrive\Documents\ventas_heladeria.csv")
df["Ingreso"] = df["Precio"] * df["Ventas"]
df

    Producto  Precio  Ventas  Ingreso
0   Vainilla     150      20     3000
1  Chocolate     180      35     6300
2      Fresa     160      25     4000
3      Mango     170      30     5100
4       Oreo     200      15     3000

In [4]:
df.groupby("Producto")["Ingreso"].sum()

Producto
Chocolate    6300
Fresa        4000
Mango        5100
Oreo         3000
Vainilla     3000
Name: Ingreso, dtype: int64

In [6]:
df.groupby("Producto").agg({
    "Ventas": ["sum", "mean"],
    "Ingreso": ["sum", "mean"]
})

          Ventas       Ingreso
             sum  mean     sum    mean
Producto
Chocolate     35  35.0    6300  6300.0
Fresa         25  25.0    4000  4000.0
Mango         30  30.0    5100  5100.0
Oreo          15  15.0    3000  3000.0
Vainilla      20  20.0    3000  3000.0

In [7]:
resumen = df.groupby("Producto")["Ingreso"].sum().sort_values(ascending=False)
resumen.to_csv("resumen_ingreso.csv")
resumen

Producto
Chocolate    6300
Mango        5100
Fresa        4000
Oreo         3000
Vainilla     3000
Name: Ingreso, dtype: int64